==================
Simple text
==================

= Introduction

test

= Second title

---

(source_file
    (title
        (text))
    (text)
    (title
        (text)))


===
function
===

#figure() <imagetag> text

#text(blue)[blue text] text

---

(source_file
    (function
        (identifier)
        (parameter_list)
        (tag
            (identifier)))
    (text)
    (function
        (identifier)
        (parameter_list
            (identifier))
        (block
            (text)))
    (text))

===
list
===

+ hi
+ sdfba
- sjdf
- sdf

---

(source_file
    (list
        (list_item)
        (list_item)
        (list_item)
        (list_item)))

===
Set Rule
===

#set heading(numbering:"1")

---

(source_file
    (set_rule
        (function
            (identifier)
            (parameter_list
                (identifier)
                (string)))))
